#!/usr/bin/env python
# -*- coding: UTF-8 -*-
'''=================================================
@Project -> File   ：qiyangPythonCrawler -> __init__.py
@IDE    ：PyCharm
@Author ：Mr. cyh
@Date   ：2021-09-15 9:14
@Desc   ：
=================================================='''

from myJDBC.jdbc import mySqlJdbc

jdbc = mySqlJdbc()
addr_datas = jdbc.get_BD_Data("zz_dqname")

"""
'肯德基', '麦当劳', '德克士', '必胜客', '王婆大虾','海底捞', '真功夫', '永和大王', '小肥羊', '味千拉面', '大娘水饺', '蜜雪冰城', '汉堡王','虾', '蟹','水饺',
 
"""
# wds = ['美食', '餐厅', '饭店', '食物', '餐馆', '餐饮', '川菜', '湘菜', '粤菜', '东北菜', '江浙菜', '浙菜', '意大利菜', '法国菜', '德国菜', '俄罗斯菜', '中东料理',
#        '日韩料理', '泰国菜', '越南菜', '印度菜', '菲律宾菜', '印尼菜', '东南亚菜', '中式快餐', '西餐', '中餐', '烤鸭', '火锅', '自助餐', '烧烤', '海鲜', '小吃',
#        '汉堡', '披萨',
#        '牛排', '寿司', '快餐', '甜点', '冷饮', '茶饮', '冰淇淋', '饮品', '面包', '西点', '烤肉', '羊蝎子', '米线', '涮羊肉', '饺子',
#        '串串香', '卤味', '香锅', '外卖', '早餐', '美食广场', '酒店', '地方小吃', '食堂']


"""
火锅
小吃

美食', '饭店', '餐馆', '餐饮','小吃','饮品','冷饮',

"""

count = 0
wd_one_s = ['美食',
            '餐厅',
            '饭店',
            '中餐厅',
            '西餐厅',
            '甜品冷饮',
            '快餐',
            '日韩料理', ]
for addr_data in addr_datas:
    # print(addr)
    addr = addr_data[1]
    id = addr_data[0]
    for wd in wd_one_s:
        print("郑州" + addr + wd)
        count += 1
print("郑州一共的搜索词有   ", count, "  个  ")
