#!/usr/bin/env python
# -*- coding: UTF-8 -*-
'''=================================================
@Project -> File   ：qiyangPythonCrawler -> start
@IDE    ：PyCharm
@Author ：Mr. cyh
@Date   ：2021-06-15 16:18
@Desc   ：
=================================================='''
from urllib import parse
cx_name_List = {"水产", "海产", "土产", "包子", "凉皮", "罐头", "速冻", "腊", "酒",
            "咖啡", "调味", "汉堡", "灭菌", "切片", "花生", "咖喱", "添加剂", "膨化", "搅拌", "乳", "橘", "梨",
            "农", "豆", "薯", "果", "菌", "肉", "稻", "食品", "食", "厨", "果蔬", "蔬", "切", "冰", "虾"
            , "猪", "牛", "羊", "鱼", "鸟", "鸡", "蛋", "米", "麦", "酱", "谷", "鸭", "鹅", "兔", "瓜"
            , "饼", "菜", "粮", "餐", "素", "骨", "枣", "栗", "糖", "奶", "饺", "茄", "麸", "糯",
            "炒", "煎", "炸", "炖", "煮", "泡", "煸", "煲", "烘", "蒸", "烤", "炖", "烧", "腌", "熏",
            "汤", "粥", "渔", "筋", "萝", "姜", "蒜", "葱", "辣", "冰", "浆", "糕", "厨", "盐",
            "糖", "笋", "炉", "榨", "碗", "屠", "吃", "腐", "禽", "畜", "麻", "馍", "馒", "蹄", "饮", "盆", "勺", "筷", "锅", "叉",
            "蜜", "孜", "馅", "丸", "罐", "汁水", "蘸", "酥", "椒", "茶", "酸", "菇", "厨卫", "锅炉", "灶", "油烟", "燃气"
            , "枣仁", "巴氏", "餐桌", "水果", "乳品", "面包", "餐具", "海参", "面粉", "面条", "面团", "面浆"
            , "餐盘", "餐车", "肠衣", "火腿肠", "蔬菜", "冰箱", "快餐", "便当", "肉制品", "肉类", "动物油", "植物油", "电热炉", "电磁炉", "碗", "碟", "盘"
            , "餐椅", "餐盒", "压面机", "切面机", "食品机械", "烧烤", "厨房", "橱柜", "酒柜", "餐车", "油炸", "火锅", "灶具", "焙", "炊", "坚果", "西餐", "中餐"
            , "冷库", "冷藏", "保鲜", "粉条", "粉皮", "增稠", "甜味", "防腐", "营养", "酸味", "鲜奶", "蜂蜜", "布丁", "液体", "苏打", "碱", "点餐"
            , "餐饮", "餐厅", "冷冻", "冷柜", "蛋类", "蛋黄", "蛋清", "剥皮", "蒸笼", "馒头", "送餐", "水饺", "饺子", "混沌", "餐垫", "纸碗", "塑料碗"
            , "炒菜", "炒菜机", "米线", "食堂", "零食", "食品", "芝麻", "五谷", "杂粮", "粗粮", "榨油", "豆制", "豆制品", "油渣", "滤油", "炒料", "腐竹"
            , "爆米花", "加料", "蛋制品", "点菜", "滚揉", "斩拌", "解冻", "茶油", "茶籽", "籽油", "籽", "食用油", "炉头", "食用", "油锅", "锅台", "火灶"
            , "灶台", "鲜米", "碾米", "厨房", "油炉", "集成灶", "烤鱼", "拌面", "削面", "麻花", "烤箱", "饸饹", "和面", "洗面", "米面", "定时锅", "面锅"
            ,"糙面","黄瓜","鸡腿","稻谷","大米","挂面","牛肉","鸡精","淀粉","粮油","豆类"
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""
            # ,"","","","","","","","","","","","","","","","",""

          }


url = "https://s.51sole.com/s.aspx?q="
for name in cx_name_List:
    print(name)
    cc = parse.quote(name)
    print(url+cc)
exit()


strName = "大锅"
asd = "%e9%a3%9f%e5%93%81" #食品
cc  = parse.quote(strName)
print(cc)

asdcc  = parse.unquote(asd)
print(asdcc)
